#!/bin/bash

# Запрос исходной и целевой директории у пользователя

read -p "Введите исходную директорию: " source_directory

read -p "Введите путь к целевой директории: " target_directory

echo  "Вы копируете файл из директории $source_directory в директорию $target_directory"

# Запрос расширения файлов, которые нужно скопировать

# Проверка существования исходной директории

# Проверка существования целевой директории

# Проверка, есть ли файлы с указанным расширением в исходной директории

# Копирование файлов с указанным расширением в целевую директорию



